<script lang="ts" setup>
  definePageMeta({
    layout: "default",
  });

  const { locale } = useI18n();

  useSeoMeta({
    title: "Home",
    description:
      "DIGIPAY е конференцията за сигурни и достъпни дигитални плащания в България. Всяка година B2B конференцията привлича все повече партньори и посетители като на последното шесто издание достигнаха над 330 души професионалисти на живо и 150 онлайн. Конференцията се фокусира върху темите за отворено банкиране, незабавни плащания, нови решения в сферата на плащанията, защита на данните, мониторинг и предотвратяване на измами, мерки срещу пране на пари и всички теми, свързани със сигурните и достъпни дигитални плащания в България. Акцент на конференцията са новите цифрови решения и сигурността на плащанията във всички сфери на икономиката, в които център е клиента.",
    keywords:
      "конференция, дигитални плащания, сигурни и удобни дигитални плащания, незабавни плащания, мобилно банкиране, отворено банкиране, еmbedded finance, предотвратяване на измами, сигурност при разплащанията решения срещу прането на пари, облачно удостоверяване, облачни технологии европейски и национални регулации, модернизация на платежната инфраструктура, Токенизация, проверка на цифрова идентичност, познай своя клиент (KYC), Биометрия мобилни приложения за разплащания и банкови услуги, машинно обучение и изкуствен интелект, блокчейн, криптовалута, нови дигитални пари, иновации, стартъп екосистема, плащания в еврозоната",
    author: "DIGIPAY",
    viewport: "width=device-width, initial-scale=1.0",
    ogTitle: "DIGIPAY",
    ogDescription:
      "DIGIPAY е конференцията за сигурни и достъпни дигитални плащания в България. Всяка година B2B конференцията привлича все повече партньори и посетители като на последното шесто издание достигнаха над 330 души професионалисти на живо и 150 онлайн. Конференцията се фокусира върху темите за отворено банкиране, незабавни плащания, нови решения в сферата на плащанията, защита на данните, мониторинг и предотвратяване на измами, мерки срещу пране на пари и всички теми, свързани със сигурните и достъпни дигитални плащания в България. Акцент на конференцията са новите цифрови решения и сигурността на плащанията във всички сфери на икономиката, в които център е клиента.",
    ogImage: "/og-image-3.png",
    ogUrl: "https://digipay.bg/",
    ogType: "website",
    ogLocale: locale.value,
    twitterTitle: "DIGIPAY",
    twitterDescription:
      "DIGIPAY е конференцията за сигурни и достъпни дигитални плащания в България. Всяка година B2B конференцията привлича все повече партньори и посетители като на последното шесто издание достигнаха над 330 души професионалисти на живо и 150 онлайн. Конференцията се фокусира върху темите за отворено банкиране, незабавни плащания, нови решения в сферата на плащанията, защита на данните, мониторинг и предотвратяване на измами, мерки срещу пране на пари и всички теми, свързани със сигурните и достъпни дигитални плащания в България. Акцент на конференцията са новите цифрови решения и сигурността на плащанията във всички сфери на икономиката, в които център е клиента.",
    twitterCard: "summary_large_image",
    twitterImage: "/og-image-3.png",
    ogSiteName: "DIGIPAY",
  });

  const scrollContainer = useState<HTMLElement | null>("scrollContainer", () => null);
</script>

<template>
  <div ref="scrollContainer" class="flex flex-col gap-20 overflow-hidden pb-32">
    <HomeHero />

    <div id="about" class="flex flex-col gap-20">
      <LazyHomeThemes />

      <LazyHomeAbout />

      <div class="pb-20">
        <LazyHomeDifferent />
      </div>

      <LazyHomeInvest />

      <!-- <LazyHomeAgenda /> -->

      <LazyHomeLastYear />

      <LazyHomeVideo />

      <LazyHomePastYears />
    </div>

    <!-- <LazyHomeSpeakers /> -->
    <!-- <LazyHomeAgenda /> -->

    <!--TODO: MAKE IT TO A NEW PAGE-->
    <!--<LazyHomePartners />-->

    <!--TODO: MAKE IT TO A NEW PAGE-->
    <!-- <div id="advisory"> -->
    <!-- <LazyHomeAdvisory /> -->
    <!-- </div> -->

    <!-- <LazyHomeBlog /> -->
  </div>
</template>

<style lang="scss">
  #about {
    scroll-snap-type: y mandatory;
    scroll-margin-top: 125px;
  }

  * {
    user-select: none;
  }
</style>
